for n in range(1,10000):
    nb=bin(n)[2:]
    if n%3==0:
        n=nb+str(nb[-3:]) # У нас двоичная запись крутиться отдкльно от исходного числа в nb
    else:
        #тут явно запутался в переменных. n уже занята циклом for.
        n=n%3
        n=bin(n*3)[2:]
        n=nb+n
    r=int(n) #первым аргументом передаем двоичную запись полученную запись, а не то что было в цикле for
    #вторым аргументом надо указывать из какой системы счисления переводим
    if r>=151:
        print(int(r))
        break
