n=int(input()) #руками чтоли перебирать будем?
# алгоритм верный, но в конце не хватает условия
bn=bin(n)[2:]
if n%3==0:
    r=bn+bn[-2:]
else:
    r=bn+bin((n%3)*3)[2:]
r=int(r,2)
#Укажите минимальное число R, не меньшее, чем 195,
print(r)