# a =  ''
# for n in range(1,1000):
#    nb = bin(n)[2:]
#    if nb.count('1')%3==0: #если число N делится на 3, а не сумма цифр двоичной записи
#        a = nb[-2:]
#        nb = nb + a
#    else:
#        ost = (nb//3)*3 #остаток проверяется числа n и вернется через %
#        ost = bin[2:]
#        nb = nb+ost
#    r = int(nb,2)
#    if r >= 195:
#        print(n)
#        break # убери его и увидишь, что числа r не будут идти в отсортированном виде -> минимальное не самое первое




for n in range(1,1000):
    nb = bin(n)[2:]
    nb = nb+nb[-1:]
    ost = nb//2 # остаток от деления ее суммы цифр на 2, а не целочисленное от строки двоично записи
    nb = nb+ost
    r = int(nb,2)
    if r < 13500:
        print(n)
